TG plan for Production

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.serverless_base_url will be updated in-place
  ~ resource "aws_ssm_parameter" "serverless_base_url" {
        id             = "/production/serverless/AC0751f021d17d50f0ee5af094acdee7c8/base_url"
      + insecure_value = (known after apply)
        name           = "/production/serverless/AC0751f021d17d50f0ee5af094acdee7c8/base_url"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/serverless/AC0751f021d17d50f0ee5af094acdee7c8/base_url"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.serverless.data.external.service_environment_production will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "service_environment_production" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "../../serverless/default/getServerlessServiceEnvironmentData.py",
        ]
      + query   = {
          + "environment_sid"    = "ZE12ad6d59ba95d24d43e184a21cfe3669"
          + "service_sid"        = "ZSbfebd43b19b4db9e3bd763b72b101eaf"
          + "twilio_account_sid" = (sensitive value)
          + "twilio_auth_token"  = (sensitive value)
        }
      + result  = (known after apply)
    }

  # module.serverless.twilio_serverless_services_v1.serverless will be updated in-place
  ~ resource "twilio_serverless_services_v1" "serverless" {
        id                  = "ZSbfebd43b19b4db9e3bd763b72b101eaf"
      ~ ui_editable         = true -> false
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
        id                   = "WS03e8228cfbf5f68aa659cf1676890587/WQb542639cb1c664d43d51902bb28c551a"
      ~ max_reserved_workers = 1 -> 5
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ event_callback_url     = "https://serverless-3162-production.twil.io/webhooks/taskrouterCallback" -> (known after apply)
        id                     = "WS03e8228cfbf5f68aa659cf1676890587"
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "1==1 OR channelType =='web' OR isContactlessTask == true"
                            filter_friendly_name = "Tinkle Friend"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQb542639cb1c664d43d51902bb28c551a"
                                },
                            ]
                        },
                        {
                            expression           = "channelType=='web' AND e2eTestMode=='true'"
                            filter_friendly_name = "E2E Test"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQ055bb97cfb7ffc95d9f88cc270d54fb9"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS03e8228cfbf5f68aa659cf1676890587/WWd56699a4851ad3f2ab79725005ddc2bf"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQ49206bff439d8969decae81ba96eeadb"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS03e8228cfbf5f68aa659cf1676890587/WWf473b8d331faa7773d095cd7b2af00e3"
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  ~ serverless_url                        = "https://serverless-3162-production.twil.io" -> (known after apply)